tap "azure/kubelogin"
tap "blendle/blendle"
tap "felixkratz/formulae"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "lencx/chatgpt", "https://github.com/lencx/ChatGPT.git"
brew "xz"
brew "openssl@3"
brew "asciiquarium"
brew "readline"
brew "sqlite"
brew "python@3.13"
brew "aws-sam-cli"
brew "awscli"
brew "bat"
brew "btop"
brew "coreutils"
brew "curl"
brew "docker"
brew "fastfetch"
brew "tesseract"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "git-filter-repo"
brew "git-lfs"
brew "glow"
brew "netpbm"
brew "graphviz"
brew "htop"
brew "jq"
brew "kubernetes-cli"
brew "kubectx"
brew "languagetool"
brew "lf"
brew "node"
brew "pandoc"
brew "pnpm"
brew "python@3.10"
brew "python@3.9"
brew "stow"
brew "tcl-tk"
brew "tldr"
brew "tree"
brew "yq"
brew "yt-dlp"
brew "zlib"
brew "zoxide"
brew "zsh-syntax-highlighting"
brew "azure/kubelogin/kubelogin"
brew "blendle/blendle/kns"
brew "hashicorp/tap/vault"
cask "amethyst"
cask "appcleaner"
cask "betterdisplay"
cask "calibre"
cask "chatgpt"
cask "deepl"
cask "devtoys"
cask "eqmac"
cask "floorp"
cask "ghostty"
cask "jordanbaird-ice"
cask "keycastr"
cask "libreoffice"
cask "maccy"
cask "notion"
cask "obsidian"
cask "openinterminal"
cask "pomotroid"
cask "qlmarkdown"
cask "rsyncosx"
cask "rsyncui"
cask "sublime-text"
cask "syntax-highlight"
cask "tomatobar"
cask "vincelwt-chatgpt"
cask "vlc"
cask "wezterm"
cask "windscribe"
cask "wkhtmltopdf"
cask "zen-browser"
vscode "adpyke.codesnap"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "aykutsarac.jsoncrack-vscode"
vscode "bastienboutonnet.vscode-dbt"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "cardinal90.multi-cursor-case-preserve"
vscode "charliermarsh.ruff"
vscode "chrisdias.vscode-opennewinstance"
vscode "codezombiech.gitignore"
vscode "csholmq.excel-to-markdown-table"
vscode "davidanson.vscode-markdownlint"
vscode "docsmsft.docs-yaml"
vscode "donjayamanne.githistory"
vscode "dvirtz.parquet-viewer"
vscode "ecmel.vscode-html-css"
vscode "emeraldwalk.runonsave"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "hediet.vscode-drawio"
vscode "iliazeus.vscode-ansi"
vscode "innoverio.vscode-dbt-power-user"
vscode "jozefchmelar.compare"
vscode "kennylong.kubernetes-yaml-formatter"
vscode "koszti.snowflake-driver-for-sqltools"
vscode "marp-team.marp-vscode"
vscode "me-dutour-mathieu.vscode-github-actions"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.isort"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.datawrangler"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-powertoys"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "mtxr.sqltools"
vscode "oderwat.indent-rainbow"
vscode "pascalreitermann93.vscode-yaml-sort"
vscode "peakchen90.open-html-in-browser"
vscode "piyushsarkar.sort-css-properties"
vscode "pkief.material-icon-theme"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "samuelcolvin.jinjahtml"
vscode "sleistner.vscode-fileutils"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "thinker.sort-json"
vscode "timonwong.shellcheck"
vscode "tomoki1207.pdf"
vscode "waderyan.gitblame"
vscode "wholroyd.jinja"
vscode "wyattferguson.jinja2-snippet-kit"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
