tap "felixkratz/formulae"
brew "bat"
brew "fastfetch"
brew "fzf"
brew "gh"
brew "git"
brew "rsync"
brew "shfmt"
brew "stow"
brew "tree"
brew "uv"
brew "worktrunk"
brew "yazi"
brew "zoxide"
brew "zsh-syntax-highlighting"
brew "felixkratz/formulae/borders"
cask "claude-code"
cask "jordanbaird-ice"
cask "wezterm"
uv "pre-commit"
uv "proofd"
uv "ruff"
uv "shandy-sqlfmt[jinjafmt]"
uv "ty"
