tap "ankitpokhrel/jira-cli"
tap "databricks/tap"
tap "felixkratz/formulae"
tap "hashicorp/tap"
tap "mlz11/tap"
tap "oven-sh/bun"
tap "snowflakedb/snowflake-cli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# More intuitive version of du in rust
brew "dust"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Audit git repos for secrets
brew "gitleaks"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# CLI for Drive, Gmail, Calendar, Sheets, Docs, Chat, Admin, and more
brew "googleworkspace-cli"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Utility that provides fast incremental file transfer
brew "rsync"
# Autoformat shell script source code
brew "shfmt"
# CLI for snowflake
brew "snowflake-cli"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Very fast implementation of tldr in Rust
brew "tealdeer"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# CLI for Git worktree management, designed for parallel AI agent workflows
brew "worktrunk"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Vault
brew "hashicorp/tap/vault", trusted: true
# macOS notifications with Claude icon for Claude Code hooks
cask "mlz11/tap/claude-notifier", trusted: true
# OpenAI's coding agent that runs in your terminal
cask "codex"
cask "font-meslo-lg-nerd-font"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Free and open-source media player
cask "iina"
# Menu bar manager
cask "jordanbaird-ice"
# Open-source keystroke visualiser
cask "keycastr"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Quick Look generator for Markdown files
cask "qlmarkdown"
vscode "adpyke.codesnap"
vscode "altimateai.vscode-altimate-mcp-server"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "anthropic.claude-code"
vscode "astral-sh.ty"
vscode "aykutsarac.jsoncrack-vscode"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-preview-github-styles"
vscode "cardinal90.multi-cursor-case-preserve"
vscode "charliermarsh.ruff"
vscode "chrisdias.vscode-opennewinstance"
vscode "codezombiech.gitignore"
vscode "csholmq.excel-to-markdown-table"
vscode "davidanson.vscode-markdownlint"
vscode "docker.docker"
vscode "docsmsft.docs-yaml"
vscode "dvirtz.parquet-viewer"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "emeraldwalk.runonsave"
vscode "esbenp.prettier-vscode"
vscode "geddski.macros"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "hediet.vscode-drawio"
vscode "iliazeus.vscode-ansi"
vscode "innoverio.vscode-dbt-power-user"
vscode "jaredly.background-terminal-notifier"
vscode "jozefchmelar.compare"
vscode "k-e-s-h-a-v.explorer-plus"
vscode "kennylong.kubernetes-yaml-formatter"
vscode "koszti.snowflake-driver-for-sqltools"
vscode "marp-team.marp-vscode"
vscode "mathiasfrohlich.kotlin"
vscode "mechatroner.rainbow-csv"
vscode "miguelsolorio.fluent-icons"
vscode "mikestead.dotenv"
vscode "mkhl.shfmt"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.datawrangler"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-powertoys"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "mtxr.sqltools"
vscode "nemesv.copy-file-name"
vscode "oderwat.indent-rainbow"
vscode "pascalreitermann93.vscode-yaml-sort"
vscode "pbkit.vscode-pbkit"
vscode "peakchen90.open-html-in-browser"
vscode "piyushsarkar.sort-css-properties"
vscode "pkief.material-icon-theme"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "samuelcolvin.jinjahtml"
vscode "sleistner.vscode-fileutils"
vscode "tamasfe.even-better-toml"
vscode "thinker.sort-json"
vscode "timonwong.shellcheck"
vscode "tomaszbartoszewski.avro-tools"
vscode "tomoki1207.pdf"
vscode "vstirbu.vscode-mermaid-preview"
vscode "wenbopan.vscode-terminal-osc-notifier"
vscode "yutengjing.open-in-external-app"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
uv "dbts"
uv "md2gdoc"
uv "prek"
uv "proofd"
uv "ruff"
uv "shandy-sqlfmt[jinjafmt]"
uv "ty"
npm "@anthropic-ai/claude-code"
npm "codeburn"
